In [1]:
import pandas as pd
import numpy as np

import scipy
from scipy import stats
import statsmodels.api as sm
from scipy.stats import chi2_contingency

# Q.1

In [2]:
# Read the data
df = pd.read_csv('D:\Data Science Assignments\Assignment 3 Hypothesis Testing\Cutlets.csv')
df

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [3]:
# Define hypothesis
# H0: Mean of unitA = Mean of unitB -> Diameter of Unit A and Unit B is equal
# HA : Mean of unitA != Mean of unitB  -> Diameter of Unit A and Unit B is not equal

In [4]:
Unit_A = df['Unit A']
Unit_B = df['Unit B']

In [5]:
static_value,p_value = stats.ttest_ind(Unit_A,Unit_B)
s,p

(0.7228688704678063, 0.4722394724599501)

In [6]:
# Interpretation
alpha =0.05
if p_value < alpha:
    print('Reject Null Hypothesis. Diameter of Unit A and Unit B is equal')
else:
    print('Fail to reject Null Hypothesis. Diameter of Unit A and Unit B is not equal')

Fail to reject Null Hypothesis. Diameter of Unit A and Unit B is not equal

# Q. 2

In [7]:
# Read the data
df = pd.read_csv('D:\Data Science Assignments\Assignment 3 Hypothesis Testing\LabTAT.csv')
df

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [8]:
# Define Hypothesis
# H0: Mean of all samples are same.
# HA : At least one mean is different.

In [9]:
f_value ,p_value = stats.f_oneway(df['Laboratory 1'],df['Laboratory 2'],df['Laboratory 3'],df['Laboratory 4'])
f_value,p_value

(118.70421654401437, 2.1156708949992414e-57)

In [10]:
# Interpretation
if p_value < 0.05:
    print('Reject Null Hypothesis. At least one sample is different.')
else:
    print('Fail to reject Null Hypothesis.Mean of all samples are same.')

Reject Null Hypothesis. At least one sample is different.

# Q. 3

In [11]:
# Read the data
df = pd.read_csv('D:\Data Science Assignments\Assignment 3 Hypothesis Testing\Buyerratio.csv',index_col=0)
df

                 East  West  North  South
Observed Values
Males              50   142    131     70
Females           435  1523   1356    750

In [12]:
Males = df.loc['Males']
Feamles = df.loc['Females']

In [13]:
# Define Hypothesis
# H0 : All proportions are equal.
# HA : All proportions are not equal.

In [14]:
t,p,df = sm.stats.ttest_ind(Males,Feamles)

In [15]:
t,p,df

(-3.5834877367684856, 0.011594334372357056, 6.0)

In [16]:
# Interpretation
if p < 0.05:
    print('Reject Null Hypothesis. Proportions of samples are not equal.')
else:
    print('Fail to reject Null hypothesis. Proportions of samples are equal.')

Reject Null Hypothesis. Proportions of samples are not equal.

# Q.4

In [17]:
# Read data
df = pd.read_csv('D:\Data Science Assignments\Assignment 3 Hypothesis Testing\Costomer+OrderForm.csv')
df

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [18]:
df['India'].unique()

array(['Error Free', 'Defective'], dtype=object)

In [19]:
df['Phillippines'].value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [20]:
df['Indonesia'].value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [21]:
df['Malta'].value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [22]:
df['India'].value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [23]:
df.columns

Index(['Phillippines', 'Indonesia', 'Malta', 'India'], dtype='object')

In [24]:
obs = pd.DataFrame({'columns': df.columns,
                    'Error':[271,267,269,280],
                    'Defective':[29,33,31,20]})
obs

        columns  Error  Defective
0  Phillippines    271         29
1     Indonesia    267         33
2         Malta    269         31
3         India    280         20

In [26]:
obs.set_index('columns',inplace=True)

In [27]:
obs

              Error  Defective
columns
Phillippines    271         29
Indonesia       267         33
Malta           269         31
India           280         20

In [28]:
chi2,p,df,exp  = chi2_contingency(obs)

In [29]:
chi2,p,df,exp

(3.8589606858203545,
 0.2771020991233144,
 3,
 array([[271.75,  28.25],
        [271.75,  28.25],
        [271.75,  28.25],
        [271.75,  28.25]]))

In [30]:
#Interpretation
if p < 0.05:
    print('Reject Null Hypothesis.Columns are dependent on each other.')
else:
    print('Fail to reject null hypothesis. Columns are independent to each other')

Fail to reject null hypothesis. Columns are independent to each other